app/views/topics/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ? ORDER BY created_at DESC  [["topic_id", 1]]
---
 <!-- #10 -->
     <% @topic.posts.each do |post| %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
             submitted <%= time_ago_in_words(post.created_at) %> ago <br>
             <%= post.comments.count %> comments

SELECT "sponsored_posts".* FROM "sponsored_posts" WHERE "sponsored_posts"."topic_id" = ?  [["topic_id", 1]]
---
     <% end %>
    <% @topic.sponsored_posts.each do |post| %>