app/views/users/show.html.erb

        <small>
          <%= pluralize(@user.posts.count, 'post') %>,
          <%= pluralize(@user.comments.count, 'comment') %>
          <%= pluralize(@user.faves.count, 'favorites') %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 9]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY rank DESC  [["user_id", 9]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 9]]
SELECT COUNT(*) FROM "posts" INNER JOIN "favorites" ON "posts"."id" = "favorites"."post_id" WHERE "favorites"."user_id" = ?  [["user_id", 9]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 9]]