app/views/posts/_post.html.erb

      submitted <%= time_ago_in_words(post.created_at) %> ago by <%= post.user.name %> <%= image_tag post.user.avatar_url(64), class: 'media-object' %> <br>
      <%= post.comments.count %> Comments
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 51]]