app/controllers/advertisements_controller.rb

  def index
    @advertisements = Advertisement.all
---
SELECT "advertisements".* FROM "advertisements"

  def show
    @advertisement = Advertisement.find(params[:id])
---
SELECT  "advertisements".* FROM "advertisements" WHERE "advertisements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @advertisement = Advertisement.new
    @advertisement.title = params[:advertisement][:title]
    @advertisement.copy = params[:advertisement][:copy]
    @advertisement.price = params[:advertisement][:price]

    if @advertisement.save
---
INSERT INTO "advertisements" ("title", "copy", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Cats"], ["copy", "Kitties"], ["price", 12], ["created_at", "2017-10-01 17:25:16.945034"], ["updated_at", "2017-10-01 17:25:16.945034"]]