app/controllers/favorites_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY rank DESC LIMIT ?  [["id", 46], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["post_id", 46], ["created_at", "2017-11-07 21:49:53.707507"], ["updated_at", "2017-11-07 21:49:53.707507"]]
---
    def create
        post = Post.find(params[:post_id])
        favorite = current_user.favorites.build(post: post)

        if favorite.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY rank DESC LIMIT ?  [["id", 51], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT ?  [["user_id", 9], ["id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 2]]
---
    def destroy
        post = Post.find(params[:post_id])
        favorite = current_user.favorites.find(params[:id])

        if favorite.destroy