app/controllers/posts_controller.rb

  def show
  #find the post that corresponds to the id in the params that was passed to show and assign it to @post
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 52], ["LIMIT", 1]]

  def create
  #call Post.new to create a new instance of Post
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.build(post_params)

    #assign @post.user in same way we assigned @post.topic, to properly scope the new post.
    @post.user = current_user

  #successfully save Post to database, display success message and redirect the user to route generated by @post
    if @post.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "topic_id") VALUES (?, ?, ?, ?, ?)  [["title", "feaf"], ["body", "fewafa"], ["created_at", "2017-10-18 03:51:25.454079"], ["updated_at", "2017-10-18 03:51:25.454079"], ["topic_id", 1]]

  def update
    @post = Post.find(params[:id])
    @post.assign_attributes(post_params)

    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 39], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Ueo qef xbh. edited as admin"], ["updated_at", "2017-11-02 06:51:41.680946"], ["id", 39]]

  def destroy
    @post = Post.find(params[:id])

#
    if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 36], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 154]]