app/controllers/posts_controller.rb

  def index
#declare instance variable @posts and assign it a collection of Post objects using all
    @posts = Post.all
---
SELECT "posts".* FROM "posts"