app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "resolved", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @question = Question.new(params.require(:question).permit(:title, :body, :resolved))
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
UPDATE "questions" SET "resolved" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["resolved", "t"], ["updated_at", "2017-10-09 19:40:38.570859"], ["id", 101]]
---
  def update
    @question = Question.find(params[:id])
    if @question.update_attributes(params.require(:question).permit(:title, :body, :resolved))

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
---
  def destroy
    @question = Question.find(params[:id])
    if @question.destroy