app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jacob.yun429@gmail.com"], ["LIMIT", 1]]
---
    def create
  # #1
      user = User.find_by(email: params[:session][:email].downcase)