app/controllers/sponsored_posts_controller.rb

  def show
  #find the post that corresponds to the id in the params that was passed to show and assign it to @sponsored_post
    @sponsored_post = SponsoredPost.find(params[:id])
---
SELECT  "sponsored_posts".* FROM "sponsored_posts" WHERE "sponsored_posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def create
  #call SponsoredPost.new to create a new instance of Post
    @sponsored_post = SponsoredPost.new
    @sponsored_post.title = params[:sponsored_post][:title]
    @sponsored_post.body = params[:sponsored_post][:body]
    @sponsored_post.price = params[:sponsored_post][:price]
    @topic = Topic.find(params[:topic_id])
    @sponsored_post.topic = @topic

  #successfully save Post to database, display success message and redirect the user to route generated by @sponsored_post
    if @sponsored_post.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sponsored_posts" ("title", "body", "price", "created_at", "updated_at", "topic_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sponsored1"], ["body", "sponsored1"], ["price", 10], ["created_at", "2017-10-20 02:49:33.588866"], ["updated_at", "2017-10-20 02:49:33.588866"], ["topic_id", 1]]