app/controllers/topics_controller.rb

INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["description", "Test"], ["created_at", "2017-10-14 21:54:00.701003"], ["updated_at", "2017-10-14 21:54:00.701003"]]
---
  def create
    @topic = Topic.new(topic_params)

    if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "topics" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["name", "Topic 1"], ["description", "Topic 1"], ["updated_at", "2017-10-14 22:29:35.023433"], ["id", 1]]
---
  def update
  @topic = Topic.find(params[:id])
  @topic.assign_attributes(topic_params)

  if @topic.save