app/controllers/users_controller.rb

    def create
    #create new user with new and set corresponding attributes from params hash
        @user = User.new
        @user.name = params[:user][:name]
        @user.email = params[:user][:email]
        @user.password = params[:user][:password]
        @user.password_confirmation = params[:user][:password_confirmation]

    #save new user to database, if successful add flash and redirect, otherwise display error
        if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?)